{
  "id": "fe110ef3-0fb1-428d-bf7a-587a9ef2fd5d",
  "content": "You don't need 600 tax strategies. You need 6 levers — the ones that actually move the needle. Every dollar you keep starts with one or more of these.\n\nMost people think taxes are about forms. They're not — they're about structure, timing, and positioning.\n\n## What You'll Learn\n\n<ul>\n  <li><strong>Understand how your tax rate is driven by income type, entity, and timing</strong></li>\n  <li><strong>See how W-2 income blocks most strategic options</strong></li>\n  <li><strong>Learn why wealthy families use leverage, not labor</strong></li>\n  <li><strong>Break down how different income flows generate deductions or drag</strong></li>\n  <li><strong>Learn how to evaluate your return using the 6-lever model</strong></li>\n</ul>\n\n\n## The 6 Core Levers\n\n### 1. Entity Type\n• Your **entity structure** determines your tax ceiling.\n• C-Corp, S-Corp, MSO, or Schedule C — they're not all created equal.\n• Strategically managing entity types is how business owners avoid double taxation and unlock deduction control.\n\n### 2. Income Type\n• Not all income is taxed equally.\n• W-2, 1099, K-1, capital gains, passive flow — each has a different tax treatment.\n• You don't need to earn less. You need to earn differently.\n\n### 3. Timing\n• Tax timing is a weapon — not a constraint.\n• Installment sales, deferred comp, Roth conversions, asset rollovers all leverage when income hits.\n\n### 4. Asset Location\n• Where your assets live changes how they're taxed.\n• Insurance wrappers, retirement accounts, real estate, and **Opportunity Zones** all have unique benefits.\n\n### 5. Deduction Strategy\n• Most CPAs miss over 50% of the deductions available.\n• True planning involves orchestrating deductions through energy, depreciation, trust layering, and timing.\n\n### 6. Exit Planning\n• If you build wealth but don't plan your exit, the IRS cashes out with you.\n• QSBS, Opportunity Zones, charitable trusts, and stepped-up basis strategy all come into play here.\n\n## Application\n\nThese levers apply to:\n• ✅ Business owners shifting to MSO or C-Corp models\n• ✅ W-2 earners creating deduction pathways using **asset location**\n• ✅ Real estate professionals leveraging depreciation\n• ✅ Exit events (business sale, asset sale, vesting RSUs)\n\nEach future module in this course — and in the full IRS Escape Plan platform — ties back to one or more of these 6 levers.\n\n## Moving Forward\n\nYou now have the lens. Every tax strategy moving forward pulls on one or more of these levers. In the next module, we'll walk through real-world case studies — showing exactly how W-2 earners and business owners legally reposition their income, time their exits, and keep hundreds of thousands more. Let's get tactical."
}