{
  "id": "648215b5-c355-4f69-95e4-f20fc63c777f",
  "content": "You've seen the levers — now see what happens when real people pull them. These are not theoretical savings. These are real shifts from W-2 earners and business owners who rewired their tax exposure and kept six figures more.\n\nThis module walks through anonymized client case studies that reflect exactly how the 6 levers are used in real scenarios. These examples will show you how a shift in entity, income type, deduction strategy, or timing can result in transformational tax savings.\n\n## What You'll Learn\n\n<ul>\n  <li><strong>Review real IRS Escape Plan clients and their savings outcomes</strong></li>\n  <li><strong>See how RSU timing saved one tech exec $91K in one year</strong></li>\n  <li><strong>Understand how STRs + energy created six figures in deductions</strong></li>\n  <li><strong>Learn how repositioning saved $325K+ for a family with idle rentals</strong></li>\n  <li><strong>Build context for your own escape strategy</strong></li>\n</ul>\n\n\n## Case Study 1 – W-2 Earner With RSUs\n\n**Client:** \"Noah\" (Tech Executive)\n**Income:** $550K W-2 + $380K **capital gains** from RSUs\n\n**Levers Pulled:**\n• Capital gains deferred using a **Qualified Opportunity Fund (QOF)**\n• Basis invested in **STR** real estate for depreciation\n• Net W-2 tax liability reduced by $96K\n\n**Key Insight:** Capital gains don't need to be cashed out — they can be repositioned for long-term tax-free growth while offsetting current W-2 tax.\n\n**The Strategy:**\nNoah was facing a massive tax bill from his RSU vesting. Instead of paying capital gains tax immediately, he invested the proceeds into a Qualified Opportunity Fund, deferring the gains. The QOF investment went into short-term rental properties, generating depreciation that offset his W-2 income. Result: $96K tax savings in year one, with the potential for tax-free growth over 10+ years.\n\n## Case Study 2 – Business Owner S-Corp Rollover\n\n**Client:** \"Jessica\" (Agency Owner)\n**Income:** $720K net income via S-Corp\n\n**Levers Pulled:**\n• Management fee routed to C-Corp MSO (Management Services Organization)\n• Retained earnings invested into Oil & Gas and equipment **bonus depreciation**\n• Effective tax liability dropped from $278K → $122K\n\n**Key Insight:** Entity structure and asset pairing can transform the taxation of earned income and convert retained earnings into deduction-fueled passive cash flow.\n\n**The Strategy:**\nJessica's agency was generating substantial profits as an S-Corp, but she was paying high personal tax rates on all the income. By creating a C-Corp MSO structure, she could retain earnings at lower corporate rates and invest them in bonus depreciation assets (oil & gas, equipment). This strategy saved her $156K in taxes while building long-term wealth through appreciating assets.\n\n## Case Study 3 – W-2 + Real Estate\n\n**Client:** \"Liam\" (Medical Professional)\n**Income:** $400K W-2 + $120K net from STR (Virginia)\n\n**Levers Pulled:**\n• Qualified as **Real Estate Professional (REPS)** via material participation\n• STR **depreciation offset** $118K of W-2 income\n• Rental income reinvested into index fund via DCA\n\n**Key Insight:** You don't need a business to get proactive. Real estate and depreciation rules can transform how income is taxed — even if you have a W-2 job.\n\n**The Strategy:**\nLiam was earning high W-2 income as a medical professional but wanted to reduce his tax burden. By qualifying for Real Estate Professional Status through material participation in his short-term rental properties, he could use the depreciation from his STR portfolio to offset his W-2 income. This strategy eliminated nearly $118K of taxable income while building a growing real estate portfolio.\n\n## Key Takeaways from the Case Studies:\n\n1. **Multiple Lever Approach:** Each case study shows how combining multiple levers creates exponential results\n2. **Income Type Conversion:** Converting high-tax W-2 income into lower-tax investment income\n3. **Timing Optimization:** Strategic deferral and acceleration of income and deductions\n4. **Entity Leverage:** Using the right business structures to access better tax treatment\n5. **Asset Positioning:** Placing the right investments in the right structures for maximum benefit\n\n## The Common Thread:\n\nThese aren't loopholes. They're strategies — structured, code-backed, and available to anyone who stops playing defense. Each strategy follows the tax code exactly as written, using the incentives Congress built into the system to encourage investment, business ownership, and economic growth.\n\nThe difference between these clients and most high earners isn't access to secret strategies — it's the knowledge of how to structure their financial lives to take advantage of the opportunities already available."
}